{
  "personalInfo": {
    "firstName": "Francesca",
    "lastName": "Ho",
    "title": "Software Developer",
    "email": "francesca.ho459@gmail.com",
    "phoneNumber": "647-501-3009",
    "location": "Toronto, Ontario",
    "links": [
      {
        "type": "linkedin",
        "url": "https://linkedin.com/in/francesca-ho",
        "text": "/francesca-ho"
      },
      {
        "type": "github",
        "url": "https://www.github.com/the-code-raccoon",
        "text": "/the-code-raccoon"
      }
    ]
  },
  "employments": [
    {
      "company": "Nautical Commerce",
      "location": "Toronto, Ontario (Hybrid)",
      "titles": [
        {
          "title": "Technical Team Lead",
          "date": "Jun 2025 to Present",
          "responsibilities": [
            "Mentored co-op students and reguarily held 1-1's with them to help develop their technical and interpersonal skills.",
            "Planned and managed technical debt improvement projects resulting in reducing the number of different frameworks used by client facing applications by 50%.",
            "Lead team of 6 developers while working closely with Product Manager and Engineering Manager to delegate resourcing, plan team roadmap and address blockers.",
            "Documented existing and new engineering processes to improve institutional knowledge across the entire engineering department.",
            "Conducted all regularly meetings for team, as well as project kick off meetings involving engineers and key stakeholders."
          ]
        },
        {
          "title": "Softare Developer II",
          "date": "Jul 2024 to Jun 2025",
          "responsibilities": [
            "Lead development of in-browser WYSIWYG e-commerce storefront editor with a custom migration system for data integrity using NextJS and Typescript.",
            "Overhauled existing checkout app using XState that reduced loading times from 6 seconds to 0.5 seconds.",
            "Implemented Stripe Tax plugin into checkout app which allowed for complex multi-vendor tax logic to be encaspulated into one simple payment step for end users.",
            "Designed and developed single sign system using OAuth allowing end users to securely signup and login via Google.",
            "Regularily conducted front end interviews for candidates of varying levels (senior to co-ops).",
            "Standarized front end interview process and trained other interviewers on how to run front end interviews to improve consistency in interviews and reduce bias."
          ]
        }
      ]
    },
    {
      "company": "BioRender",
      "location": "Toronto, Ontario (Remote)",
      "titles": [
        {
          "title": "Software Developer, Editor Team",
          "date": "Nov 2023 to Jun 2024",
          "responsibilities": [
            "Created features for an in-browser editor built using Typescript, React and Redux.",
            "Worked directly on in-browser new graphing product by building technical foundations and contributing to core graphing engine."
          ]
        },
        {
          "title": "Software Developer, Growth Team",
          "date": "Mar 2023 to Nov 2023",
          "responsibilities": [
            "Conducted and iterated on 2+ fast paced experiemnts every week.",
            "Implemented front-end changes to signup flow that improved the collection of user data, resulting in more personalized content and more user engagement.",
            "Developed personalized content targeting enterprise customers, resulting in a 20% lift in product-qualified leads.",
            "Implemented monetization features directly into the BioRender editor leading to over $3.2 million annual recurring revenue."
          ]
        },
        {
          "title": "Software Developer, Internal Tools",
          "date": "Jul 22 to Mar 2023",
          "responsibilities": [
            "Lead degvelopment of internal API and UI, using Retool, that supported over 300 BioRender employees and streamlined internal processes resulting in over 20 hours saved per employee per week.",
            "Developed new enterprise dashboard features to help admins manage hundreds of organizations, totalling hundreds of thousands of BioRender users.",
            "Improved consistency in data lake and database, totalling over 20,000 documents updated.",
            "Lead the migration and retirement of legacy features that affected over 10,000 users and updated over 100,000 database entities.",
            "Provided technical support and troubleshooting using Elastic to non-engineering teams, averaging 4 requests per day and a resolution time of 1 hour."
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Toronto",
      "date": "2021",
      "subject": "Computer Science"
    }
  ],
  "skills": [
    {
      "grouping": "Languages",
      "items": [
        "Typescript",
        "Javascript",
        "Python",
        "Java",
        "HTML",
        "CSS"
      ]
    },
    {
      "grouping": "Frameworks/Libraries",
      "items": [
        "React",
        "Django",
        "NextJS",
        "Remix",
        "NodeJS",
        "Redux",
        "Express",
        "GraphQL",
        "Fastify",
        "OAuth",
        "Recaptcha",
        "socket.io",
        "Stripe API",
        "Stripe Tax API",
        "Retool",
        "SCSS",
        "Bootstrap",
        "TailwindCSS",
        "XState",
        "KeyCloak",
        "jQuery"
      ]
    },
    {
      "grouping": "Infrastructure",
      "items": [
        "Kubernetes",
        "Docker",
        "ElasticSearch",
        "OpenTelemetry",
        "Honeycomb",
        "Kibana",
        "OpsGenie",
        "Linux",
        "Github Actions",
        "Helm/Helmchart",
        "AWS"
      ]
    },
    {
      "grouping": "Misc",
      "items": [
        "PostgreSQL",
        "MongoDB",
        "SQL",
        "Git",
        "Agile Development",
        "JIRA",
        "Slack",
        "Github",
        "Metabase",
        "SendGrid",
        "Mailgun",
        "Figma",
        "Graphite",
        "Notion"
      ]
    },
    {
      "grouping": "Testing",
      "items": [
        "Jest",
        "Cypress",
        "Storybook",
        "Mocha",
        "Chai",
        "Pytest"
      ]
    }
  ]
}
